# Faire demo GitHub // Live Quizz

- Différence entre remote et local?

hello

- Comment créer un repo, quelles particularités au moment de la création?

- Si on a commencé en remote, comment créer son équivalent en local?

- Si on a commencé en local, comment créer son équivalent en remote?

- Je change un fichier en local. Que se passe-t-il ? Comment je fais pour le rendre visible en remote?

- A quoi servent les branches?

git pull origin master
git add .
git commit -m "changes to hello.py"
git push origin nbancel-test

# Structure de données

## Series

- Documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html
- Montrer concept d'attributs de series
- On a instancé la classe Series

In [217]:
import pandas as pd
import numpy as np

In [230]:
random_series = pd.Series(np.random.randn(4))
random_series

0    1.891342
1   -1.842587
2   -0.452881
3   -0.010570
dtype: float64

In [221]:
print(random_series.name)

None

In [9]:
random_series.index

RangeIndex(start=0, stop=4, step=1)

In [222]:
random_series.values

array([-0.14840047, -0.26590051, -0.96211536,  0.14589755])

In [232]:
# Updating the index and the name:
random_series.name = 'Random numbers'
random_series.index = ['A','B','C', 'D']

In [227]:
random_series

A   -0.148400
B   -0.265901
C   -0.962115
D    0.145898
Name: Random numbers, dtype: float64

## DataFrame

- Succession de series. Auxquelles on donne un nom: le nom de la colonne
- Montrer concept de series // index // colonnes

In [228]:
dic = {"A":[1,2,3,5], "B":[1,4,2,3]}

In [229]:
df = pd.DataFrame(dic)
df

   A  B
0  1  1
1  2  4
2  3  2
3  5  3

In [233]:
df_new = pd.DataFrame(random_series)
df_new

   Random numbers
A        1.891342
B       -1.842587
C       -0.452881
D       -0.010570

# Import d'une base de données

- Parler des fonctions d'import
- Naviguer avec python dans un dossier
    - Bash : %%bash
    - Avec librairie os

In [235]:
#csv = pd.read_csv("chipotles.csv")

## Bash

In [241]:
%%bash
cd ..
pwd
ls

/Users/nicolasbancel/git/jedha/fullstack/s1_python
s1_a_lundi_1
s1_b_samedi
s2_b_samedi

In [16]:
%%bash
ls

new_prenoms.csv
prenoms.csv
s2_b_exercice_solution.ipynb
s2_b_live_code.ipynb

In [240]:
# Only 1 command per cell 
!pwd
#!ls

/Users/nicolasbancel/git/jedha/fullstack/s1_python/s2_b_samedi

In [237]:
!ls

50_Startups.csv             s2_b_exercice_corrige.ipynb
chipotle.csv                s2_b_exercice_enonce.ipynb
new_prenoms.csv             s2_b_live_code.ipynb
prenoms.csv

## OS library

In [242]:
import os
os.getcwd()

'/Users/nicolasbancel/git/jedha/fullstack/s1_python/s2_b_samedi'

In [20]:
os.listdir()

['prenoms.csv',
 's2_b_live_code.ipynb',
 '.ipynb_checkpoints',
 's2_b_exercice_solution.ipynb',
 'new_prenoms.csv']

In [243]:
os.chdir('/Users/nicolasbancel/git/jedha/fullstack/s1_python')
os.getcwd()

'/Users/nicolasbancel/git/jedha/fullstack/s1_python'

In [244]:
os.listdir()

['s2_b_samedi', '.DS_Store', 's1_a_lundi_1', 's1_b_samedi']

In [245]:
os.chdir('s2_b_samedi')

In [246]:
os.listdir()

['.DS_Store',
 'chipotle.csv',
 'prenoms.csv',
 's2_b_live_code.ipynb',
 '.ipynb_checkpoints',
 '50_Startups.csv',
 's2_b_exercice_enonce.ipynb',
 's2_b_exercice_corrige.ipynb',
 'new_prenoms.csv']

## Loading the file

- https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html
- Go over some arguments for csv

In [247]:
csv = pd.read_csv("chipotle.csv")
csv.head()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [248]:
data = pd.DataFrame({"prénoms":["Lucien", "Jocelyne", "Brigitte"], "Age":[29, 43, 32]})
data

    prénoms  Age
0    Lucien   29
1  Jocelyne   43
2  Brigitte   32

## Export de fichier

- Marche pas parce que mauvais path

In [249]:
data.to_csv("Downloads/prenoms.csv")

FileNotFoundError: [Errno 2] No such file or directory: 'Downloads/prenoms.csv'

In [250]:
data.to_csv('/Users/nicolasbancel/Downloads/prenoms.csv')

In [252]:
data.to_csv('/Users/nicolasbancel/Downloads/prenoms.csv', sep="\t")

- Problème fichier du dessus: 
    - Donne l'index

In [253]:
data.to_csv('prenoms.csv', sep="\t", index=False)

In [32]:
new_data_dirty = pd.DataFrame({"prénoms":["Lucien", "Jocelyne", "Brigitte", "René", "é¤àè©%ê®ï•¾"], "Age":[29, 43, 32, 27, 18]})

In [254]:
new_data_dirty.to_csv('new_prenoms.csv', sep="\t", index=False, encoding='utf-8')

## Explorer base de données

In [304]:
from sklearn import datasets
iris = datasets.load_iris()
iris = pd.DataFrame(iris.data)
iris = iris.rename(index=int,columns= {0:"Sepal Length",1:"Sepal Width",2:"Petal Length", 3: "Petal Width"})

In [303]:
iris = datasets.load_iris()
iris

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': '/usr/local/lib/python3.7/site-packages/sklearn/datasets/data/iris.csv'}

In [275]:
iris_df = pd.DataFrame(iris.data)
iris_df.head()

     0    1    2    3
0  5.1  3.5  1.4  0.2
1  4.9  3.0  1.4  0.2
2  4.7  3.2  1.3  0.2
3  4.6  3.1  1.5  0.2
4  5.0  3.6  1.4  0.2

In [257]:
iris_df.index

RangeIndex(start=0, stop=150, step=1)

In [276]:
iris = iris_df.rename(index=int,columns= {0:"Sepal Length",1:"Sepal Width",2:"Petal Length", 3: "Petal Width"})

In [259]:
iris.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
           dtype='int64', length=150)

In [260]:
iris.columns

Index(['Sepal Length', 'Sepal Width', 'Petal Length', 'Petal Width'], dtype='object')

## Manipulation

In [263]:
iris.head()

   Sepal Length  Sepal Width  Petal Length  Petal Width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [264]:
iris.tail()

     Sepal Length  Sepal Width  Petal Length  Petal Width
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

In [42]:
iris.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
           dtype='int64', length=150)

In [265]:
iris.columns

Index(['Sepal Length', 'Sepal Width', 'Petal Length', 'Petal Width'], dtype='object')

In [267]:
# Rendu sous la forme d'un tableau
#iris.values

## Cleaner les données

In [45]:
iris.columns

Index(['Sepal Length', 'Sepal Width', 'Petal Length', 'Petal Width'], dtype='object')

In [268]:
new_list = []

for x in iris.columns:
    new = x.lower().replace(' ','_')
    new_list.append(new)
    print(new)

sepal_length
sepal_width
petal_length
petal_width

In [269]:
new_list

['sepal_length', 'sepal_width', 'petal_length', 'petal_width']

In [270]:
iris.columns = new_list

In [271]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [277]:
iris.columns = [x.lower().replace(' ','_') for x in iris.columns]
iris.head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

## Selectionner des données

In [279]:
iris['sepal_length'].head()

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

### Iloc et loc // Quand on peut harcoder : on sait précisément ce qu'on veut extraire

In [282]:
iris.loc[0:4, ['sepal_length', 'sepal_width']]

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6

In [283]:
iris.iloc[0:4, 0:3]

   sepal_length  sepal_width  petal_length
0           5.1          3.5           1.4
1           4.9          3.0           1.4
2           4.7          3.2           1.3
3           4.6          3.1           1.5

In [286]:
iris.iloc[0:4, -1]

0    0.2
1    0.2
2    0.2
3    0.2
Name: petal_width, dtype: float64

### where

In [291]:
iris.head(15)

    sepal_length  sepal_width  petal_length  petal_width
0            5.1          3.5           1.4          0.2
1            4.9          3.0           1.4          0.2
2            4.7          3.2           1.3          0.2
3            4.6          3.1           1.5          0.2
4            5.0          3.6           1.4          0.2
5            5.4          3.9           1.7          0.4
6            4.6          3.4           1.4          0.3
7            5.0          3.4           1.5          0.2
8            4.4          2.9           1.4          0.2
9            4.9          3.1           1.5          0.1
10           5.4          3.7           1.5          0.2
11           4.8          3.4           1.6          0.2
12           4.8          3.0           1.4          0.1
13           4.3          3.0           1.1          0.1
14           5.8          4.0           1.2          0.2

In [292]:
iris["sepal_length"].mean()

5.843333333333334

In [290]:
# Valeurs qui ne respectent pas la condition sont remplacées par des NaN
iris.where(iris["sepal_length"] > iris["sepal_length"].mean())

     sepal_length  sepal_width  petal_length  petal_width
0             NaN          NaN           NaN          NaN
1             NaN          NaN           NaN          NaN
2             NaN          NaN           NaN          NaN
3             NaN          NaN           NaN          NaN
4             NaN          NaN           NaN          NaN
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

### Masques : evite problème des NaN

In [293]:
iris[iris["sepal_length"] > 5.843333333333334]

     sepal_length  sepal_width  petal_length  petal_width
50            7.0          3.2           4.7          1.4
51            6.4          3.2           4.5          1.5
52            6.9          3.1           4.9          1.5
54            6.5          2.8           4.6          1.5
56            6.3          3.3           4.7          1.6
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[70 rows x 4 columns]

In [294]:
## Retirer les outliers

iris[(iris["sepal_length"] < iris["sepal_length"].mean() + 2 * iris["sepal_length"].std()) &
(iris["sepal_length"] > iris["sepal_length"].mean() - 2 * iris["sepal_length"].std())]

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[144 rows x 4 columns]

### query()

In [295]:
iris.query("index > 140")

     sepal_length  sepal_width  petal_length  petal_width
141           6.9          3.1           5.1          2.3
142           5.8          2.7           5.1          1.9
143           6.8          3.2           5.9          2.3
144           6.7          3.3           5.7          2.5
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

- Autres exemples: [ici](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.query.html)

## Manipuler base de donnée : ajout de colonne

In [296]:
import numpy as np
iris["nouvelle_colonne"] = pd.Series(np.random.randn(150))

In [297]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width  nouvelle_colonne
0           5.1          3.5           1.4          0.2          0.784915
1           4.9          3.0           1.4          0.2          1.229957
2           4.7          3.2           1.3          0.2          1.434711
3           4.6          3.1           1.5          0.2         -0.827770
4           5.0          3.6           1.4          0.2          0.734299

In [298]:
iris["custom"] = iris["sepal_length"] + iris["sepal_width"]
iris

,sepal_length,sepal_width,petal_length,petal_width,nouvelle_colonne,custom
0,5.1,3.5,1.4,0.2,0.784915,8.6
1,4.9,3.0,1.4,0.2,1.229957,7.9
2,4.7,3.2,1.3,0.2,1.434711,7.9
3,4.6,3.1,1.5,0.2,-0.827770,7.7
4,5.0,3.6,1.4,0.2,0.734299,8.6
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,-0.060956,9.7
146,6.3,2.5,5.0,1.9,-1.474713,8.8
147,6.5,3.0,5.2,2.0,1.350990,9.5
148,6.2,3.4,5.4,2.3,-0.689931,9.6
149,5.9,3.0,5.1,1.8,0.737948,8.9

## Manipuler base de donnée : ajout de ligne

In [305]:
from sklearn import datasets
iris = datasets.load_iris()
iris = pd.DataFrame(iris.data)
iris = iris.rename(index=int,columns= {0:"Sepal Length",1:"Sepal Width",2:"Petal Length", 3: "Petal Width"})
iris.columns = [x.lower().replace(' ','_') for x in iris.columns]

In [307]:
iris["nouvelle_colonne"] = pd.Series(np.random.randn(150))
iris["custom"] = iris["sepal_length"] + iris["sepal_width"]
iris.head()

,sepal_length,sepal_width,petal_length,petal_width,nouvelle_colonne,custom
0,5.1,3.5,1.4,0.2,-1.215172,8.6
1,4.9,3.0,1.4,0.2,-1.161732,7.9
2,4.7,3.2,1.3,0.2,2.168878,7.9
3,4.6,3.1,1.5,0.2,-1.442661,7.7
4,5.0,3.6,1.4,0.2,0.181695,8.6

In [299]:
import pandas as pd
import numpy as np

series = pd.Series(np.random.randn(6), name ="une serie")
series

0   -1.567019
1    0.412679
2    1.474578
3    1.999947
4    0.742617
5   -1.729463
Name: une serie, dtype: float64

In [300]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'nouvelle_colonne', 'custom'],
      dtype='object')

In [308]:
series.index = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width','nouvelle_colonne', 'custom']

In [309]:
series

sepal_length       -1.567019
sepal_width         0.412679
petal_length        1.474578
petal_width         1.999947
nouvelle_colonne    0.742617
custom             -1.729463
Name: une serie, dtype: float64

In [310]:
# ignore index 
iris.append(series)

,sepal_length,sepal_width,petal_length,petal_width,nouvelle_colonne,custom
0,5.100000,3.500000,1.400000,0.200000,-1.215172,8.600000
1,4.900000,3.000000,1.400000,0.200000,-1.161732,7.900000
2,4.700000,3.200000,1.300000,0.200000,2.168878,7.900000
3,4.600000,3.100000,1.500000,0.200000,-1.442661,7.700000
4,5.000000,3.600000,1.400000,0.200000,0.181695,8.600000
...,...,...,...,...,...,...
146,6.300000,2.500000,5.000000,1.900000,-2.325810,8.800000
147,6.500000,3.000000,5.200000,2.000000,-0.768849,9.500000
148,6.200000,3.400000,5.400000,2.300000,-0.470660,9.600000
149,5.900000,3.000000,5.100000,1.800000,3.194039,8.900000
une serie,-1.567019,0.412679,1.474578,1.999947,0.742617,-1.729463

In [311]:
# S'il y a un nom dans la serie, ignore son nom quand ajouté comme index (préférable)
iris.append(series, ignore_index = True)

,sepal_length,sepal_width,petal_length,petal_width,nouvelle_colonne,custom
0,5.100000,3.500000,1.400000,0.200000,-1.215172,8.600000
1,4.900000,3.000000,1.400000,0.200000,-1.161732,7.900000
2,4.700000,3.200000,1.300000,0.200000,2.168878,7.900000
3,4.600000,3.100000,1.500000,0.200000,-1.442661,7.700000
4,5.000000,3.600000,1.400000,0.200000,0.181695,8.600000
...,...,...,...,...,...,...
146,6.300000,2.500000,5.000000,1.900000,-2.325810,8.800000
147,6.500000,3.000000,5.200000,2.000000,-0.768849,9.500000
148,6.200000,3.400000,5.400000,2.300000,-0.470660,9.600000
149,5.900000,3.000000,5.100000,1.800000,3.194039,8.900000
150,-1.567019,0.412679,1.474578,1.999947,0.742617,-1.729463

In [69]:
# N'ignore pas le nom et l'ajoute en tant qu'index : à éviter
iris.append(series, ignore_index = False)

,sepal_length,sepal_width,petal_length,petal_width,nouvelle_colonne,custom
0,5.10000,3.500000,1.400000,0.200000,0.332323,8.600000
1,4.90000,3.000000,1.400000,0.200000,1.494330,7.900000
2,4.70000,3.200000,1.300000,0.200000,0.243995,7.900000
3,4.60000,3.100000,1.500000,0.200000,-1.255996,7.700000
4,5.00000,3.600000,1.400000,0.200000,-0.623889,8.600000
...,...,...,...,...,...,...
146,6.30000,2.500000,5.000000,1.900000,1.027833,8.800000
147,6.50000,3.000000,5.200000,2.000000,-0.304751,9.500000
148,6.20000,3.400000,5.400000,2.300000,-0.591034,9.600000
149,5.90000,3.000000,5.100000,1.800000,-1.684991,8.900000
une serie,0.81677,1.180297,0.225587,-1.141534,-0.921713,-0.778367

## Modifier des éléments : fonction lambda

- Cas d'usage : python marche ligne par ligne dans un dataframe : on peut appliquer une formule à chaque élément: .apply(lambda x: CODE)

In [312]:
iris['sepal_width'].apply(lambda x: x**2)

0      12.25
1       9.00
2      10.24
3       9.61
4      12.96
       ...
145     9.00
146     6.25
147     9.00
148    11.56
149     9.00
Name: sepal_width, Length: 150, dtype: float64

In [313]:
iris["sepal_width"].apply(lambda x: x**2 if x < 3.3 else 0)

0       0.00
1       9.00
2      10.24
3       9.61
4       0.00
       ...
145     9.00
146     6.25
147     9.00
148     0.00
149     9.00
Name: sepal_width, Length: 150, dtype: float64

## Valeurs manquantes

- Important en ML : s'en débarasser
- D'abord, les identifier
- isnull et isnan exactement pareil [ici](https://datascience.stackexchange.com/questions/37878/difference-between-isna-and-isnull-in-pandas)

In [314]:
dataframe = pd.DataFrame({"A" : [np.nan]*10, "B":np.random.randn(10)})

In [315]:
dataframe

    A         B
0 NaN  0.960784
1 NaN -0.123970
2 NaN  1.223525
3 NaN -0.000291
4 NaN  0.451145
5 NaN  0.747887
6 NaN  0.127387
7 NaN  1.350558
8 NaN -0.744850
9 NaN  0.826309

In [316]:
dataframe.isnull()

      A      B
0  True  False
1  True  False
2  True  False
3  True  False
4  True  False
5  True  False
6  True  False
7  True  False
8  True  False
9  True  False

In [317]:
dataframe.isna()

      A      B
0  True  False
1  True  False
2  True  False
3  True  False
4  True  False
5  True  False
6  True  False
7  True  False
8  True  False
9  True  False

In [318]:
dataframe.notnull()

       A     B
0  False  True
1  False  True
2  False  True
3  False  True
4  False  True
5  False  True
6  False  True
7  False  True
8  False  True
9  False  True

In [319]:
dataframe.notna()

       A     B
0  False  True
1  False  True
2  False  True
3  False  True
4  False  True
5  False  True
6  False  True
7  False  True
8  False  True
9  False  True

In [320]:
dataframe.isna().any()

A     True
B    False
dtype: bool

In [321]:
dataframe.isna().sum()

A    10
B     0
dtype: int64

### Remplacer valeurs manquantes

- Effacer ou remplacer

In [322]:
df_na_old = pd.DataFrame({'A' : ['-0.182942','1.118365',np.nan,'0.894408','-1.526481','0.446217','-1.163180','-1.862217','1.285901','0.142029'],
      'B' : ['0.961464','0.029694','1.023198',np.nan,np.nan,'-0.459517','-0.099550','-0.485977','0.863137','-0.689244'],
      'C' : ['0.587028','0.214251','0.051008','-0.316871','0.467221','-0.060871','-0.845913','2.250946',np.nan,'1.815439']})

In [323]:
df_na = pd.DataFrame({'A' : [-0.182942,1.118365,np.nan,0.894408,-1.526481,0.446217,-1.163180,-1.862217,1.285901,0.142029],
      'B' : [0.961464,0.029694,1.023198,np.nan,np.nan,-0.459517,-0.099550,-0.485977,0.863137,-0.689244],
      'C' : [0.587028,0.214251,0.051008,-0.316871,0.467221,-0.060871,-0.845913,2.250946,np.nan,1.815439]})

In [324]:
df_na

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
2       NaN  1.023198  0.051008
3  0.894408       NaN -0.316871
4 -1.526481       NaN  0.467221
5  0.446217 -0.459517 -0.060871
6 -1.163180 -0.099550 -0.845913
7 -1.862217 -0.485977  2.250946
8  1.285901  0.863137       NaN
9  0.142029 -0.689244  1.815439

In [116]:
df_na_smaller = pd.DataFrame({'A' : [-0.182942,1.118365,np.nan],
      'B' : [0.961464,0.029694,1.023198],
      'C' : [0.587028,0.214251,0.051008]})

In [325]:
df_na['A'].mean()

-0.09421111111111108

In [326]:
df_na.dtypes

A    float64
B    float64
C    float64
dtype: object

- Remplacer par nombre

In [327]:
df_na.fillna(10)

           A          B          C
0  -0.182942   0.961464   0.587028
1   1.118365   0.029694   0.214251
2  10.000000   1.023198   0.051008
3   0.894408  10.000000  -0.316871
4  -1.526481  10.000000   0.467221
5   0.446217  -0.459517  -0.060871
6  -1.163180  -0.099550  -0.845913
7  -1.862217  -0.485977   2.250946
8   1.285901   0.863137  10.000000
9   0.142029  -0.689244   1.815439

In [328]:
# Utile pour valeurs catégoriques
df_na.fillna('Valeur manquante')

                  A                 B                 C
0         -0.182942          0.961464          0.587028
1           1.11837          0.029694          0.214251
2  Valeur manquante            1.0232          0.051008
3          0.894408  Valeur manquante         -0.316871
4          -1.52648  Valeur manquante          0.467221
5          0.446217         -0.459517         -0.060871
6          -1.16318          -0.09955         -0.845913
7          -1.86222         -0.485977           2.25095
8            1.2859          0.863137  Valeur manquante
9          0.142029         -0.689244           1.81544

In [123]:
df_na['A'].mean()

-0.09421111111111108

In [330]:
# Remplir avec une valeur de moyenne d'une seule colonne
df_na.fillna(df_na['A'].mean())

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
2 -0.094211  1.023198  0.051008
3  0.894408 -0.094211 -0.316871
4 -1.526481 -0.094211  0.467221
5  0.446217 -0.459517 -0.060871
6 -1.163180 -0.099550 -0.845913
7 -1.862217 -0.485977  2.250946
8  1.285901  0.863137 -0.094211
9  0.142029 -0.689244  1.815439

In [331]:
# Remplir de manière dynamique avec la moyenne de chaque colonne
df_na.mean()

A   -0.094211
B    0.142901
C    0.462471
dtype: float64

In [333]:
# Remplir avec une valeur de moyenne d'une seule colonne
df_na.fillna(df_na.median())

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
2  0.142029  1.023198  0.051008
3  0.894408 -0.034928 -0.316871
4 -1.526481 -0.034928  0.467221
5  0.446217 -0.459517 -0.060871
6 -1.163180 -0.099550 -0.845913
7 -1.862217 -0.485977  2.250946
8  1.285901  0.863137  0.214251
9  0.142029 -0.689244  1.815439

### Effacer valeurs manquantes

- Supprimer la ligne qui contient valeur manquante
- Supprimer la colonne

In [334]:
# Les indexes ne sont pas reset
df_na.dropna(axis=0)

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
5  0.446217 -0.459517 -0.060871
6 -1.163180 -0.099550 -0.845913
7 -1.862217 -0.485977  2.250946
9  0.142029 -0.689244  1.815439

In [335]:
# Fonction ci dessous créé une colonne d'index : pas forcément ce qu'on recherche
df_na.dropna(axis=0).reset_index()

   index         A         B         C
0      0 -0.182942  0.961464  0.587028
1      1  1.118365  0.029694  0.214251
2      5  0.446217 -0.459517 -0.060871
3      6 -1.163180 -0.099550 -0.845913
4      7 -1.862217 -0.485977  2.250946
5      9  0.142029 -0.689244  1.815439

In [336]:
# Pour éviter ca : on drop la 1ère colonne générée par le reset_index
df_na.dropna(axis=0).reset_index(drop=True)

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
2  0.446217 -0.459517 -0.060871
3 -1.163180 -0.099550 -0.845913
4 -1.862217 -0.485977  2.250946
5  0.142029 -0.689244  1.815439

In [337]:
# Dangereux parce que chaque colonne contient au moins 1 NaN
df_na.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

### Interpolation

In [339]:
df_na

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
2       NaN  1.023198  0.051008
3  0.894408       NaN -0.316871
4 -1.526481       NaN  0.467221
5  0.446217 -0.459517 -0.060871
6 -1.163180 -0.099550 -0.845913
7 -1.862217 -0.485977  2.250946
8  1.285901  0.863137       NaN
9  0.142029 -0.689244  1.815439

In [340]:
# Linear by default
df_na.interpolate()

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
2  1.006387  1.023198  0.051008
3  0.894408  0.528960 -0.316871
4 -1.526481  0.034721  0.467221
5  0.446217 -0.459517 -0.060871
6 -1.163180 -0.099550 -0.845913
7 -1.862217 -0.485977  2.250946
8  1.285901  0.863137  2.033193
9  0.142029 -0.689244  1.815439

In [341]:
# Linear by default
df_na.interpolate(method = "polynomial", order = 2)

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
2  1.836955  1.023198  0.051008
3  0.894408  1.038578 -0.316871
4 -1.526481 -0.090598  0.467221
5  0.446217 -0.459517 -0.060871
6 -1.163180 -0.099550 -0.845913
7 -1.862217 -0.485977  2.250946
8  1.285901  0.863137  3.503598
9  0.142029 -0.689244  1.815439

## Variables catégoriques

- Ordinateur n'interprète pas chaîne de caractères 
- A la fin, on veut faire de la prédiction: formule avec chaque input : besoin de les transformer en valeur numérique

In [342]:
categories = pd.DataFrame({"Moyens de transports":["Vélo","Vélo", "Voiture", "Bus", "Bus", "Uber"]})

In [145]:
df_na.describe()

              A         B         C
count  9.000000  8.000000  9.000000
mean  -0.094211  0.142901  0.462471
std    1.174101  0.705708  0.991763
min   -1.862217 -0.689244 -0.845913
25%   -1.163180 -0.466132 -0.060871
50%    0.142029 -0.034928  0.214251
75%    0.894408  0.887719  0.587028
max    1.285901  1.023198  2.250946

In [343]:
categories.describe()

       Moyens de transports
count                     6
unique                    4
top                     Bus
freq                      2

In [344]:
categories

  Moyens de transports
0                 Vélo
1                 Vélo
2              Voiture
3                  Bus
4                  Bus
5                 Uber

In [345]:
pd.get_dummies(categories)

,Moyens de transports_Bus,Moyens de transports_Uber,Moyens de transports_Voiture,Moyens de transports_Vélo
0,0,0,0,1
1,0,0,0,1
2,0,0,1,0
3,1,0,0,0
4,1,0,0,0
5,0,1,0,0

- **Problème 1** : a-t-on besoin de la dernière colonne?
- **Problème 2** : la convention de notation des colonnes n'est pas top : espaces

In [346]:
pd.get_dummies(categories, prefix="Transport", drop_first=True)

   Transport_Uber  Transport_Voiture  Transport_Vélo
0               0                  0               1
1               0                  0               1
2               0                  1               0
3               0                  0               0
4               0                  0               0
5               1                  0               0

## Corrélation variables

- Passe un peu de temps à expliquer le principe
- [Définitions ici](http://spss.espaceweb.usherbrooke.ca/pages/stat-inferentielles/correlation.php)

In [348]:
startups = pd.read_csv("50_Startups.csv")
corr = startups.corr()

In [349]:
corr

                 R&D Spend  Administration  Marketing Spend    Profit
R&D Spend         1.000000        0.241955         0.724248  0.972900
Administration    0.241955        1.000000        -0.032154  0.200717
Marketing Spend   0.724248       -0.032154         1.000000  0.747766
Profit            0.972900        0.200717         0.747766  1.000000

- En machine learning : on fera une régression linéaire. A votre avis, quel élément impactera le plus le profit?

## Aggrégation d'une base de données

In [350]:
df_na

          A         B         C
0 -0.182942  0.961464  0.587028
1  1.118365  0.029694  0.214251
2       NaN  1.023198  0.051008
3  0.894408       NaN -0.316871
4 -1.526481       NaN  0.467221
5  0.446217 -0.459517 -0.060871
6 -1.163180 -0.099550 -0.845913
7 -1.862217 -0.485977  2.250946
8  1.285901  0.863137       NaN
9  0.142029 -0.689244  1.815439

In [351]:
df_na["Moyens de transports"] = ["Vélo","Vélo", "Voiture", "Bus", "Bus", "Uber", "RER", "RER", "RER", "RER"]
df_na["Moyens de transports 2"] = ["Vélo","Vélo", "Voiture", "Bus", "Bus", "Uber", "RER", "RER", "RER", "RER"]

In [352]:
df_na = df_na.drop(columns=['Moyens de transports 2'])

In [353]:
df_na

          A         B         C Moyens de transports
0 -0.182942  0.961464  0.587028                 Vélo
1  1.118365  0.029694  0.214251                 Vélo
2       NaN  1.023198  0.051008              Voiture
3  0.894408       NaN -0.316871                  Bus
4 -1.526481       NaN  0.467221                  Bus
5  0.446217 -0.459517 -0.060871                 Uber
6 -1.163180 -0.099550 -0.845913                  RER
7 -1.862217 -0.485977  2.250946                  RER
8  1.285901  0.863137       NaN                  RER
9  0.142029 -0.689244  1.815439                  RER

In [356]:
df_na.groupby('Moyens de transports')

In [357]:
grouped_by = df_na.groupby('Moyens de transports').mean()
grouped_by

                             A         B         C
Moyens de transports
Bus                  -0.316036       NaN  0.075175
RER                  -0.399367 -0.102908  1.073491
Uber                  0.446217 -0.459517 -0.060871
Voiture                    NaN  1.023198  0.051008
Vélo                  0.467712  0.495579  0.400639

In [358]:
grouped_by.index

Index(['Bus', 'RER', 'Uber', 'Voiture', 'Vélo'], dtype='object', name='Moyens de transports')

In [359]:
grouped_by.columns

Index(['A', 'B', 'C'], dtype='object')

In [360]:
df_na.groupby('Moyens de transports').mean().reset_index()

  Moyens de transports         A         B         C
0                  Bus -0.316036       NaN  0.075175
1                  RER -0.399367 -0.102908  1.073491
2                 Uber  0.446217 -0.459517 -0.060871
3              Voiture       NaN  1.023198  0.051008
4                 Vélo  0.467712  0.495579  0.400639

In [361]:
# Tous types de groupings peuvent être faits
df_na.groupby('Moyens de transports').median()

                             A         B         C
Moyens de transports
Bus                  -0.316036       NaN  0.075175
RER                  -0.510576 -0.292764  1.815439
Uber                  0.446217 -0.459517 -0.060871
Voiture                    NaN  1.023198  0.051008
Vélo                  0.467712  0.495579  0.400639

In [362]:
df_na.groupby('Moyens de transports').std()

                             A         B         C
Moyens de transports
Bus                   1.711827       NaN  0.554437
RER                   1.397209  0.688909  1.676454
Uber                       NaN       NaN       NaN
Voiture                    NaN       NaN       NaN
Vélo                  0.920163  0.658861  0.263593

## Manipulation de plusieurs bases de données

- Parler de SQL
- Process de pull des données et de manipulation

### Concat simple

In [364]:
temps_de_transport = pd.Series([10,12,40,20,21,35], name="temps_de_transport")
temps_de_transport

0    10
1    12
2    40
3    20
4    21
5    35
Name: temps_de_transport, dtype: int64

In [365]:
moyens_transport = pd.Series(["Vélo","Vélo", "Voiture", "Bus", "Bus", "Uber"], name="moyens_de_transports")
moyens_transport

0       Vélo
1       Vélo
2    Voiture
3        Bus
4        Bus
5       Uber
Name: moyens_de_transports, dtype: object

In [366]:
moyens_transport_probleme = pd.Series(["Vélo","Vélo", "Voiture", "Bus", "Bus"], name="moyens_de_transports_probleme")
moyens_transport_probleme

0       Vélo
1       Vélo
2    Voiture
3        Bus
4        Bus
Name: moyens_de_transports_probleme, dtype: object

In [367]:
pd.concat([moyens_transport, temps_de_transport], axis=1)

  moyens_de_transports  temps_de_transport
0                 Vélo                  10
1                 Vélo                  12
2              Voiture                  40
3                  Bus                  20
4                  Bus                  21
5                 Uber                  35

In [368]:
pd.concat([moyens_transport_probleme, temps_de_transport], axis=1)

  moyens_de_transports_probleme  temps_de_transport
0                          Vélo                  10
1                          Vélo                  12
2                       Voiture                  40
3                           Bus                  20
4                           Bus                  21
5                           NaN                  35

In [370]:
resume_transport_temps = pd.concat([moyens_transport_probleme, temps_de_transport], axis=1)
resume_transport_temps

  moyens_de_transports_probleme  temps_de_transport
0                          Vélo                  10
1                          Vélo                  12
2                       Voiture                  40
3                           Bus                  20
4                           Bus                  21
5                           NaN                  35

### Jointure - via l'index

In [372]:
distance = pd.DataFrame({"distance_travail":[ 2.1,2.2,10, 20, 30]}, index = [3,0,1,4,2])
distance

   distance_travail
3               2.1
0               2.2
1              10.0
4              20.0
2              30.0

In [373]:
# Jointure sur l'index
# En SQL, ca s'appelle un LEFT JOIN. On remplace les valeurs qui ne matchent pas par des NULLs
# Plutôt que de les enlever
# Scénario de valeur manquante : table d'order, à matcher avec table de customers
modes_transport = pd.concat([resume_transport_temps, distance], axis=1)
modes_transport

  moyens_de_transports_probleme  temps_de_transport  distance_travail
0                          Vélo                  10               2.2
1                          Vélo                  12              10.0
2                       Voiture                  40              30.0
3                           Bus                  20               2.1
4                           Bus                  21              20.0
5                           NaN                  35               NaN

### INNER JOIN : se débarasser des records qui ne matchent pas

In [374]:
modes_de_transport_inner = pd.concat([resume_transport_temps,distance], axis = 1, join="inner")
modes_de_transport_inner

  moyens_de_transports_probleme  temps_de_transport  distance_travail
0                          Vélo                  10               2.2
1                          Vélo                  12              10.0
2                       Voiture                  40              30.0
3                           Bus                  20               2.1
4                           Bus                  21              20.0

## Jointures plus complexes (moins limitantes)

- Jointures avec concat ne sont que des jointures par index
- On va voir une autre méthode de jointure : par nom de colonne

In [375]:
modes_de_transports = pd.DataFrame({'moyens_transport':['Velo','Velo','Voiture','Uber', 'Bus', 'RER', 'Uber', 'RER'],
                                   'pollution':['A', 'A', 'D', 'D', 'B', 'A', 'D', 'A']})

In [376]:
types_de_transports = pd.DataFrame({'types_de_transport':['Velo','Voiture','Uber', 'Bus', 'RER'],
                                   'vitesse':[15, 65, 65, 50, 45]})

In [377]:
modes_de_transports

  moyens_transport pollution
0             Velo         A
1             Velo         A
2          Voiture         D
3             Uber         D
4              Bus         B
5              RER         A
6             Uber         D
7              RER         A

In [378]:
types_de_transports

  types_de_transport  vitesse
0               Velo       15
1            Voiture       65
2               Uber       65
3                Bus       50
4                RER       45

In [381]:
# Executer ca
transportation = pd.merge(modes_de_transports, types_de_transports, left_on = 'moyens_transport',
                         right_on = 'types_de_transport',
                         how = 'inner')

In [382]:
transportation = pd.merge(modes_de_transports, types_de_transports, left_on = 'moyens_transport',
                         right_on = 'types_de_transport',
                         how = 'inner')
transportation

  moyens_transport pollution types_de_transport  vitesse
0             Velo         A               Velo       15
1             Velo         A               Velo       15
2          Voiture         D            Voiture       65
3             Uber         D               Uber       65
4             Uber         D               Uber       65
5              Bus         B                Bus       50
6              RER         A                RER       45
7              RER         A                RER       45

In [384]:
transportation[['moyens_transport', 'pollution', 'vitesse']]

  moyens_transport pollution  vitesse
0             Velo         A       15
1             Velo         A       15
2          Voiture         D       65
3             Uber         D       65
4             Uber         D       65
5              Bus         B       50
6              RER         A       45
7              RER         A       45

In [386]:
transportation[['moyens_transport']]

  moyens_transport
0             Velo
1             Velo
2          Voiture
3             Uber
4             Uber
5              Bus
6              RER
7              RER

## Ré arranger les données

- Très utile dans les time series
- Exemple ici : [Energy consumption](https://towardsdatascience.com/clustering-electricity-profiles-with-k-means-42d6d0644d00)

In [387]:
consumption = pd.DataFrame({'day': ['2020-05-08','2020-05-08','2020-05-08', '2020-05-07','2020-05-07','2020-05-07'],
                           'period': ['matin','midi','soir', 'matin','midi','soir'],
                           'conso' : [200, 400, 800, 300, 450, 900]})
consumption

          day period  conso
0  2020-05-08  matin    200
1  2020-05-08   midi    400
2  2020-05-08   soir    800
3  2020-05-07  matin    300
4  2020-05-07   midi    450
5  2020-05-07   soir    900

In [388]:
pd.pivot_table(consumption, values = 'conso', index = 'day', columns = 'period')

period      matin  midi  soir
day
2020-05-07    300   450   900
2020-05-08    200   400   800